nxp-mcuxpresso/mcux-sdk/devices/MKM35Z7/MKM35Z7.h
#define __CM0PLUS_REV                  0x0000    /**< Core revision r0p0 */
#define __MPU_PRESENT                  0         /**< Defines if an MPU is present or not */
#define __VTOR_PRESENT                 1         /**< Defines if VTOR is present or not */
#define __NVIC_PRIO_BITS               2         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */

#include "core_cm0plus.h"              /* Core Peripheral Access Layer */
#include "system_MKM35Z7.h"            /* Device specific configuration file */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
/*!
 * @addtogroup edma_request
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request into DMAMUX to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */
typedef enum _dma_request_source
{
    kDmaRequestMux0Disable          = 0|0x100U,    /**< DMAMUX TriggerDisabled */
    kDmaRequestMux0Reserved1        = 1|0x100U,    /**< Reserved1 */
    kDmaRequestMux0UART0Rx          = 2|0x100U,    /**< UART0 Receive */
    kDmaRequestMux0UART0Tx          = 3|0x100U,    /**< UART0 Transmit */
    kDmaRequestMux0UART1Rx          = 4|0x100U,    /**< UART1 Receive */
    kDmaRequestMux0UART1Tx          = 5|0x100U,    /**< UART1 Transmit */
    kDmaRequestMux0UART2Rx          = 6|0x100U,    /**< UART2 Receive */
    kDmaRequestMux0UART2Tx          = 7|0x100U,    /**< UART2 Transmit */
    kDmaRequestMux0UART3Rx          = 8|0x100U,    /**< UART3 Receive */
    kDmaRequestMux0UART3Tx          = 9|0x100U,    /**< UART3 Transmit */
    kDmaRequestMux0Reserved10       = 10|0x100U,   /**< Reserved10 */
    kDmaRequestMux0Reserved11       = 11|0x100U,   /**< Reserved11 */
    kDmaRequestMux0Reserved12       = 12|0x100U,   /**< Reserved12 */
    kDmaRequestMux0Reserved13       = 13|0x100U,   /**< Reserved13 */
    kDmaRequestMux0Reserved14       = 14|0x100U,   /**< Reserved14 */
    kDmaRequestMux0Reserved15       = 15|0x100U,   /**< Reserved15 */
    kDmaRequestMux0SPI0Rx           = 16|0x100U,   /**< SPI0 Receive */
    kDmaRequestMux0SPI0Tx           = 17|0x100U,   /**< SPI0 Transmit */
    kDmaRequestMux0SPI1Rx           = 18|0x100U,   /**< SPI1 Receive */
    kDmaRequestMux0SPI1Tx           = 19|0x100U,   /**< SPI1 Transmit */
    kDmaRequestMux0SPI2Rx           = 20|0x100U,   /**< SPI2 Receive */
    kDmaRequestMux0SPI2Tx           = 21|0x100U,   /**< SPI2 Transmit */
    kDmaRequestMux0I2C0             = 22|0x100U,   /**< I2C0 */
    kDmaRequestMux0I2C1             = 23|0x100U,   /**< I2C1 */
    kDmaRequestMux0TMR0Channel0     = 24|0x100U,   /**< TPMCH0 */
    kDmaRequestMux0TMR0Channel1     = 25|0x100U,   /**< TPMCH1 */
    kDmaRequestMux0TMR0Channel2     = 26|0x100U,   /**< TPMCH2 */
    kDmaRequestMux0TMR0Channel3     = 27|0x100U,   /**< TPMCH3 */
    kDmaRequestMux0XBARRequest0     = 28|0x100U,   /**< XBARCH0 */
    kDmaRequestMux0XBARRequest1     = 29|0x100U,   /**< XBARCH1 */
    kDmaRequestMux0XBARRequest2     = 30|0x100U,   /**< XBARCH2 */
    kDmaRequestMux0XBARRequest3     = 31|0x100U,   /**< XBARCH3 */
    kDmaRequestMux0AFEChannel0      = 32|0x100U,   /**< AFECH0 */
    kDmaRequestMux0AFEChannel1      = 33|0x100U,   /**< AFECH1 */
    kDmaRequestMux0AFEChannel2      = 34|0x100U,   /**< AFECH2 */
    kDmaRequestMux0AFEChannel3      = 35|0x100U,   /**< AFECH3 */
    kDmaRequestMux0PortJ            = 36|0x100U,   /**< GPIO Port J */
    kDmaRequestMux0PortK            = 37|0x100U,   /**< GPIO Port K */
    kDmaRequestMux0PortL            = 38|0x100U,   /**< GPIO Port L */
    kDmaRequestMux0PortM            = 39|0x100U,   /**< GPIO Port M */
    kDmaRequestMux0SarADC           = 40|0x100U,   /**< ADC */
    kDmaRequestMux0Reserved41       = 41|0x100U,   /**< Reserved41 */
    kDmaRequestMux0CMP0             = 42|0x100U,   /**< CMP0 */
    kDmaRequestMux0CMP1             = 43|0x100U,   /**< CMP1 */
    kDmaRequestMux0CMP2             = 44|0x100U,   /**< CMP2 */
    kDmaRequestMux0Reserved45       = 45|0x100U,   /**< Reserved45 */
    kDmaRequestMux0Reserved46       = 46|0x100U,   /**< Reserved46 */
    kDmaRequestMux0MMAU             = 47|0x100U,   /**< MMAU */
    kDmaRequestMux0PDB0             = 48|0x100U,   /**< PDB0 */
    kDmaRequestMux0PORTA            = 49|0x100U,   /**< GPIO Port A */
    kDmaRequestMux0PORTB            = 50|0x100U,   /**< GPIO Port B */
    kDmaRequestMux0PORTC            = 51|0x100U,   /**< GPIO Port C */
    kDmaRequestMux0PORTD            = 52|0x100U,   /**< GPIO Port D */
    kDmaRequestMux0PORTE            = 53|0x100U,   /**< GPIO Port E */
    kDmaRequestMux0PORTF            = 54|0x100U,   /**< GPIO Port F */
    kDmaRequestMux0PORTG            = 55|0x100U,   /**< GPIO Port G */
    kDmaRequestMux0PORTH            = 56|0x100U,   /**< GPIO Port H */
    kDmaRequestMux0PORTI            = 57|0x100U,   /**< GPIO Port I */
    kDmaRequestMux0LPUART0Rx        = 58|0x100U,   /**< LPUART0 Receive */
    kDmaRequestMux0LPUART0Tx        = 59|0x100U,   /**< LPUART0 Transmit */
    kDmaRequestMux0AlwaysOn60       = 60|0x100U,   /**< DMAMUX Always Enabled slot */
    kDmaRequestMux0AlwaysOn61       = 61|0x100U,   /**< DMAMUX Always Enabled slot */
    kDmaRequestMux0AlwaysOn62       = 62|0x100U,   /**< DMAMUX Always Enabled slot */
    kDmaRequestMux0AlwaysOn63       = 63|0x100U,   /**< DMAMUX Always Enabled slot */
} dma_request_source_t;

/* @} */

typedef enum _xbar_input_signal
{
    kXBAR_InputVdd                  = 0|0x100U,    /**< Logic 1 (VDD) output assigned to XBAR_IN0 input. */
    kXBAR_InputVss                  = 1|0x100U,    /**< Logic 0 (VSS) output assigned to XBAR_IN1 input. */
    kXBAR_InputAfeClock             = 2|0x100U,    /**< AFE modulator clock output output assigned to XBAR_IN2 input. */
    kXBAR_InputAfeMod0DataOutput    = 3|0x100U,    /**< AFE modulator 0 data output output assigned to XBAR_IN3 input. */
    kXBAR_InputLptmr0Output         = 4|0x100U,    /**< LPTimer0 Output output assigned to XBAR_IN4 input. */
    kXBAR_InputClockOutput          = 5|0x100U,    /**< Clock Output output assigned to XBAR_IN5 input. */
    kXBAR_InputTmrCh0Output         = 6|0x100U,    /**< Quad Timer channel 0 output output assigned to XBAR_IN6 input. */
    kXBAR_InputTmrCh1Output         = 7|0x100U,    /**< Quad Timer channel 1 output output assigned to XBAR_IN7 input. */
    kXBAR_InputTmrCh2Output         = 8|0x100U,    /**< Quad Timer channel 2 output output assigned to XBAR_IN8 input. */
    kXBAR_InputTmrCh3Output         = 9|0x100U,    /**< Quad Timer channel 3 output output assigned to XBAR_IN9 input. */
    kXBAR_InputRtcClockOutput       = 10|0x100U,   /**< iRTC Clock Output output assigned to XBAR_IN10 input. */
    kXBAR_InputCmp0Output           = 11|0x100U,   /**< CMP0 Output output assigned to XBAR_IN11 input. */
    kXBAR_InputCmp1Output           = 12|0x100U,   /**< CMP1 Output output assigned to XBAR_IN12 input. */
    kXBAR_InputRtcAlarmOutput       = 13|0x100U,   /**< iRTC Alarm Output output assigned to XBAR_IN13 input. */
    kXBAR_InputUartTxOutput         = 14|0x100U,   /**< UART TX Output (after modulation) output assigned to XBAR_IN14 input. */
    kXBAR_InputEwmOutput            = 15|0x100U,   /**< EWM Output (EWM_OUT) output assigned to XBAR_IN15 input. */
    kXBAR_InputPit0Tif0             = 16|0x100U,   /**< PIT 0 Timer Interrupt Flag 0 (Timeout 0) output assigned to XBAR_IN16 input. */
    kXBAR_InputXbarIn0              = 17|0x100U,   /**< XBAR Input pin 0 output assigned to XBAR_IN17 input. */
    kXBAR_InputXbarIn1              = 18|0x100U,   /**< XBAR Input pin 1 output assigned to XBAR_IN18 input. */
    kXBAR_InputXbarIn2              = 19|0x100U,   /**< XBAR Input pin 2 output assigned to XBAR_IN19 input. */
    kXBAR_InputXbarIn3              = 20|0x100U,   /**< XBAR Input pin 3 output assigned to XBAR_IN20 input. */
    kXBAR_InputXbarIn4              = 21|0x100U,   /**< XBAR Input pin 4 output assigned to XBAR_IN21 input. */
    kXBAR_InputXbarIn5              = 22|0x100U,   /**< XBAR Input pin 5 output assigned to XBAR_IN22 input. */
    kXBAR_InputXbarIn6              = 23|0x100U,   /**< XBAR Input pin 6 output assigned to XBAR_IN23 input. */
    kXBAR_InputXbarIn7              = 24|0x100U,   /**< XBAR Input pin 7 output assigned to XBAR_IN24 input. */
    kXBAR_InputXbarIn8              = 25|0x100U,   /**< XBAR Input pin 8 output assigned to XBAR_IN25 input. */
    kXBAR_InputAdcCocoFlag          = 26|0x100U,   /**< ORed conversion complete flag for all SAR ADC channels output assigned to XBAR_IN26 input. */
    kXBAR_InputAfeAllCocFlag        = 27|0x100U,   /**< ORed conversion complete flag for all AFE channels output assigned to XBAR_IN27 input. */
    kXBAR_InputAfeCh0CocFlag        = 28|0x100U,   /**< AFE Channel 0 conversion complete output assigned to XBAR_IN28 input. */
    kXBAR_InputAfeCh1CocFlag        = 29|0x100U,   /**< AFE Channel 1 conversion complete output assigned to XBAR_IN29 input. */
    kXBAR_InputAfeCh2CocFlag        = 30|0x100U,   /**< AFE Channel 2 conversion complete output assigned to XBAR_IN30 input. */
    kXBAR_InputAfeCh3CocFlag        = 31|0x100U,   /**< AFE Channel 3 conversion complete output assigned to XBAR_IN31 input. */
    kXBAR_InputDmaDoneSignal        = 32|0x100U,   /**< DMA Done Signal output assigned to XBAR_IN32 input. */
    kXBAR_InputXbarIn9              = 33|0x100U,   /**< XBAR Input pin 9 output assigned to XBAR_IN33 input. */
    kXBAR_InputXbarIn10             = 34|0x100U,   /**< XBAR Input pin 10 output assigned to XBAR_IN34 input. */
    kXBAR_InputCmp2Output           = 35|0x100U,   /**< CMP2 Output output assigned to XBAR_IN35 input. */
    kXBAR_InputPit0Tif1             = 36|0x100U,   /**< PIT 0 Timer Interrupt Flag 1 (Timeout 1) output assigned to XBAR_IN36 input. */
    kXBAR_InputPit1Tif0             = 37|0x100U,   /**< PIT 1 Timer Interrupt Flag 0 (Timeout 0) output assigned to XBAR_IN37 input. */
    kXBAR_InputPit1Tif1             = 38|0x100U,   /**< PIT 1 Timer Interrupt Flag 1 (Timeout 1) output assigned to XBAR_IN38 input. */
    kXBAR_InputAfeMod1DataOutput    = 39|0x100U,   /**< AFE modulator 1 data output output assigned to XBAR_IN39 input. */
    kXBAR_InputAfeMod2DataOutput    = 40|0x100U,   /**< AFE modulator 2 data output output assigned to XBAR_IN40 input. */
    kXBAR_InputAfeMod3DataOutput    = 41|0x100U,   /**< AFE modulator 3 data output output assigned to XBAR_IN41 input. */
    kXBAR_InputAdcCocoA             = 42|0x100U,   /**< SAR ADC conversion complete A output assigned to XBAR_IN42 input. */
    kXBAR_InputAdcCocoB             = 43|0x100U,   /**< SAR ADC conversion complete B output assigned to XBAR_IN43 input. */
    kXBAR_InputAdcCocoC             = 44|0x100U,   /**< SAR ADC conversion complete C output assigned to XBAR_IN44 input. */
    kXBAR_InputAdcCocoD             = 45|0x100U,   /**< SAR ADC conversion complete D output assigned to XBAR_IN45 input. */
    kXBAR_InputPdb0Ch0Pretrigger0   = 46|0x100U,   /**< PDB0 CH0 Pre-trigger 0 output assigned to XBAR_IN46 input. */
    kXBAR_InputPdb0Ch0Pretrigger1   = 47|0x100U,   /**< PDB0 CH0 Pre-trigger 1 output assigned to XBAR_IN47 input. */
    kXBAR_InputPdb0Ch0Pretrigger2   = 48|0x100U,   /**< PDB0 CH0 Pre-trigger 2 output assigned to XBAR_IN48 input. */
    kXBAR_InputPdb0Ch0Pretrigger3   = 49|0x100U,   /**< PDB0 CH0 Pre-trigger 3 output assigned to XBAR_IN49 input. */
    kXBAR_InputPdb0Ch0Trigger       = 50|0x100U,   /**< PDB0 CH0 Trigger output assigned to XBAR_IN50 input. */
    kXBAR_InputPdb0PulseOut0        = 51|0x100U,   /**< PDB0 Pulse-Out 0 output assigned to XBAR_IN51 input. */
    kXBAR_InputLptmr1Output         = 52|0x100U,   /**< LPTimer1 Output output assigned to XBAR_IN52 input. */
} xbar_input_signal_t;

