nxp-mcuxpresso/mcux-sdk/devices/MKM35Z7/MKM35Z7.h
/*! @name PTOR - Port Toggle Output Register */
/*! @{ */
#define FGPIO_PTOR_PTTO_MASK                     (0xFFFFFFFFU)
#define FGPIO_PTOR_PTTO_SHIFT                    (0U)
/*! PTTO - Port Toggle Output
 *  0b00000000000000000000000000000000..Corresponding bit in PDORn does not change.
 *  0b00000000000000000000000000000001..Corresponding bit in PDORn is set to the inverse of its existing logic state.
 */
#define FGPIO_PTOR_PTTO(x)                       (((uint32_t)(((uint32_t)(x)) << FGPIO_PTOR_PTTO_SHIFT)) & FGPIO_PTOR_PTTO_MASK)
/*! @} */

/*! @name PDIR - Port Data Input Register */
/*! @{ */
#define FGPIO_PDIR_PDI_MASK                      (0xFFFFFFFFU)
#define FGPIO_PDIR_PDI_SHIFT                     (0U)
/*! PDI - Port Data Input
 *  0b00000000000000000000000000000000..Pin logic level is logic 0, or is not configured for use by digital function.
 *  0b00000000000000000000000000000001..Pin logic level is logic 1.
 */
#define FGPIO_PDIR_PDI(x)                        (((uint32_t)(((uint32_t)(x)) << FGPIO_PDIR_PDI_SHIFT)) & FGPIO_PDIR_PDI_MASK)
/*! @} */

/*! @name PDDR - Port Data Direction Register */
/*! @{ */
#define FGPIO_PDDR_PDD_MASK                      (0xFFFFFFFFU)
#define FGPIO_PDDR_PDD_SHIFT                     (0U)
/*! PDD - Port Data Direction
 *  0b00000000000000000000000000000000..Pin is configured as general-purpose input, for the GPIO function.
 *  0b00000000000000000000000000000001..Pin is configured as general-purpose output, for the GPIO function.
 */
#define FGPIO_PDDR_PDD(x)                        (((uint32_t)(((uint32_t)(x)) << FGPIO_PDDR_PDD_SHIFT)) & FGPIO_PDDR_PDD_MASK)
/*! @} */

/*! @name GACR - GPIO Attribute Checker Register */
/*! @{ */
#define FGPIO_GACR_ACB0_MASK                     (0x7U)
#define FGPIO_GACR_ACB0_SHIFT                    (0U)
/*! ACB0 - Attribute Check Byte 0
 *  0b000..User nonsecure: Read + Write; User Secure: Read + Write; Privileged Secure: Read + Write
 *  0b001..User nonsecure: Read; User Secure: Read + Write; Privileged Secure: Read + Write
 *  0b010..User nonsecure: None; User Secure: Read + Write; Privileged Secure: Read + Write
 *  0b011..User nonsecure: Read; User Secure: Read; Privileged Secure: Read + Write
 *  0b100..User nonsecure: None; User Secure: Read; Privileged Secure: Read + Write
 *  0b101..User nonsecure: None; User Secure: None; Privileged Secure: Read + Write
 *  0b110..User nonsecure: None; User Secure: None; Privileged Secure: Read
 *  0b111..User nonsecure: None; User Secure: None; Privileged Secure: None
 */
#define FGPIO_GACR_ACB0(x)                       (((uint32_t)(((uint32_t)(x)) << FGPIO_GACR_ACB0_SHIFT)) & FGPIO_GACR_ACB0_MASK)
#define FGPIO_GACR_ROB0_MASK                     (0x80U)
#define FGPIO_GACR_ROB0_SHIFT                    (7U)
/*! ROB0 - Read-Only Byte 0
 *  0b0..Writes to the GPIOn_GACR are allowed.
 *  0b1..Writes to the GPIOn_GACR are ignored.
 */
#define FGPIO_GACR_ROB0(x)                       (((uint32_t)(((uint32_t)(x)) << FGPIO_GACR_ROB0_SHIFT)) & FGPIO_GACR_ROB0_MASK)
#define FGPIO_GACR_ACB1_MASK                     (0x700U)
#define FGPIO_GACR_ACB1_SHIFT                    (8U)
/*! ACB1 - Attribute Check Byte 1
 *  0b000..User nonsecure: Read + Write; User Secure: Read + Write; Privileged Secure: Read + Write
 *  0b001..User nonsecure: Read; User Secure: Read + Write; Privileged Secure: Read + Write
 *  0b010..User nonsecure: None; User Secure: Read + Write; Privileged Secure: Read + Write
 *  0b011..User nonsecure: Read; User Secure: Read; Privileged Secure: Read + Write
 *  0b100..User nonsecure: None; User Secure: Read; Privileged Secure: Read + Write
 *  0b101..User nonsecure: None; User Secure: None; Privileged Secure: Read + Write
 *  0b110..User nonsecure: None; User Secure: None; Privileged Secure: Read
 *  0b111..User nonsecure: None; User Secure: None; Privileged Secure: None
 */
#define FGPIO_GACR_ACB1(x)                       (((uint32_t)(((uint32_t)(x)) << FGPIO_GACR_ACB1_SHIFT)) & FGPIO_GACR_ACB1_MASK)
#define FGPIO_GACR_ROB1_MASK                     (0x8000U)
#define FGPIO_GACR_ROB1_SHIFT                    (15U)
/*! ROB1 - Read-Only Byte 1
 *  0b0..Writes to the GPIOn_GACR are allowed.
 *  0b1..Writes to the GPIOn_GACR are ignored.
 */
#define FGPIO_GACR_ROB1(x)                       (((uint32_t)(((uint32_t)(x)) << FGPIO_GACR_ROB1_SHIFT)) & FGPIO_GACR_ROB1_MASK)
#define FGPIO_GACR_ACB2_MASK                     (0x70000U)
#define FGPIO_GACR_ACB2_SHIFT                    (16U)
/*! ACB2 - Attribute Check Byte 2
 *  0b000..User nonsecure: Read + Write; User Secure: Read + Write; Privileged Secure: Read + Write
 *  0b001..User nonsecure: Read; User Secure: Read + Write; Privileged Secure: Read + Write
 *  0b010..User nonsecure: None; User Secure: Read + Write; Privileged Secure: Read + Write
 *  0b011..User nonsecure: Read; User Secure: Read; Privileged Secure: Read + Write
 *  0b100..User nonsecure: None; User Secure: Read; Privileged Secure: Read + Write
 *  0b101..User nonsecure: None; User Secure: None; Privileged Secure: Read + Write
 *  0b110..User nonsecure: None; User Secure: None; Privileged Secure: Read
 *  0b111..User nonsecure: None; User Secure: None; Privileged Secure: None
 */
#define FGPIO_GACR_ACB2(x)                       (((uint32_t)(((uint32_t)(x)) << FGPIO_GACR_ACB2_SHIFT)) & FGPIO_GACR_ACB2_MASK)
#define FGPIO_GACR_ROB2_MASK                     (0x800000U)
#define FGPIO_GACR_ROB2_SHIFT                    (23U)
/*! ROB2 - Read-Only Byte 2
 *  0b0..Writes to the GPIOn_GACR are allowed.
 *  0b1..Writes to the GPIOn_GACR are ignored.
 */
#define FGPIO_GACR_ROB2(x)                       (((uint32_t)(((uint32_t)(x)) << FGPIO_GACR_ROB2_SHIFT)) & FGPIO_GACR_ROB2_MASK)
#define FGPIO_GACR_ACB3_MASK                     (0x7000000U)
#define FGPIO_GACR_ACB3_SHIFT                    (24U)
/*! ACB3 - Attribute Check Byte 3
 *  0b000..User nonsecure: Read + Write; User Secure: Read + Write; Privileged Secure: Read + Write
 *  0b001..User nonsecure: Read; User Secure: Read + Write; Privileged Secure: Read + Write
 *  0b010..User nonsecure: None; User Secure: Read + Write; Privileged Secure: Read + Write
 *  0b011..User nonsecure: Read; User Secure: Read; Privileged Secure: Read + Write
 *  0b100..User nonsecure: None; User Secure: Read; Privileged Secure: Read + Write
 *  0b101..User nonsecure: None; User Secure: None; Privileged Secure: Read + Write
 *  0b110..User nonsecure: None; User Secure: None; Privileged Secure: Read
 *  0b111..User nonsecure: None; User Secure: None; Privileged Secure: None
 */
#define FGPIO_GACR_ACB3(x)                       (((uint32_t)(((uint32_t)(x)) << FGPIO_GACR_ACB3_SHIFT)) & FGPIO_GACR_ACB3_MASK)
#define FGPIO_GACR_ROB3_MASK                     (0x80000000U)
#define FGPIO_GACR_ROB3_SHIFT                    (31U)
/*! ROB3 - Read-Only Byte 3
 *  0b0..Writes to the GPIOn_GACR are allowed.
 *  0b1..Writes to the GPIOn_GACR are ignored.
 */
#define FGPIO_GACR_ROB3(x)                       (((uint32_t)(((uint32_t)(x)) << FGPIO_GACR_ROB3_SHIFT)) & FGPIO_GACR_ROB3_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group FGPIO_Register_Masks */


/* FGPIO - Peripheral instance base addresses */
/** Peripheral FGPIOA base address */
#define FGPIOA_BASE                              (0xF8000000u)
/** Peripheral FGPIOA base pointer */
#define FGPIOA                                   ((FGPIO_Type *)FGPIOA_BASE)
/** Peripheral FGPIOB base address */
#define FGPIOB_BASE                              (0xF8000001u)
/** Peripheral FGPIOB base pointer */
#define FGPIOB                                   ((FGPIO_Type *)FGPIOB_BASE)
/** Peripheral FGPIOC base address */
#define FGPIOC_BASE                              (0xF8000002u)
/** Peripheral FGPIOC base pointer */
#define FGPIOC                                   ((FGPIO_Type *)FGPIOC_BASE)
/** Peripheral FGPIOD base address */
#define FGPIOD_BASE                              (0xF8000003u)
/** Peripheral FGPIOD base pointer */
#define FGPIOD                                   ((FGPIO_Type *)FGPIOD_BASE)
/** Peripheral FGPIOE base address */
#define FGPIOE_BASE                              (0xF8000040u)
/** Peripheral FGPIOE base pointer */
#define FGPIOE                                   ((FGPIO_Type *)FGPIOE_BASE)
/** Peripheral FGPIOF base address */
#define FGPIOF_BASE                              (0xF8000041u)
/** Peripheral FGPIOF base pointer */
#define FGPIOF                                   ((FGPIO_Type *)FGPIOF_BASE)
/** Peripheral FGPIOG base address */
#define FGPIOG_BASE                              (0xF8000042u)
/** Peripheral FGPIOG base pointer */
#define FGPIOG                                   ((FGPIO_Type *)FGPIOG_BASE)
/** Peripheral FGPIOH base address */
#define FGPIOH_BASE                              (0xF8000043u)
/** Peripheral FGPIOH base pointer */
#define FGPIOH                                   ((FGPIO_Type *)FGPIOH_BASE)
/** Peripheral FGPIOI base address */
#define FGPIOI_BASE                              (0xF8000080u)
/** Peripheral FGPIOI base pointer */
#define FGPIOI                                   ((FGPIO_Type *)FGPIOI_BASE)
/** Peripheral FGPIOJ base address */
#define FGPIOJ_BASE                              (0xF8000081u)
/** Peripheral FGPIOJ base pointer */
#define FGPIOJ                                   ((FGPIO_Type *)FGPIOJ_BASE)
/** Peripheral FGPIOK base address */
#define FGPIOK_BASE                              (0xF8000082u)
/** Peripheral FGPIOK base pointer */
#define FGPIOK                                   ((FGPIO_Type *)FGPIOK_BASE)
/** Peripheral FGPIOL base address */
#define FGPIOL_BASE                              (0xF8000083u)
/** Peripheral FGPIOL base pointer */
#define FGPIOL                                   ((FGPIO_Type *)FGPIOL_BASE)
/** Peripheral FGPIOM base address */
#define FGPIOM_BASE                              (0xF80000C0u)
/** Peripheral FGPIOM base pointer */
#define FGPIOM                                   ((FGPIO_Type *)FGPIOM_BASE)
/** Array initializer of FGPIO peripheral base addresses */
#define FGPIO_BASE_ADDRS                         { FGPIOA_BASE, FGPIOB_BASE, FGPIOC_BASE, FGPIOD_BASE, FGPIOE_BASE, FGPIOF_BASE, FGPIOG_BASE, FGPIOH_BASE, FGPIOI_BASE, FGPIOJ_BASE, FGPIOK_BASE, FGPIOL_BASE, FGPIOM_BASE }
/** Array initializer of FGPIO peripheral base pointers */
#define FGPIO_BASE_PTRS                          { FGPIOA, FGPIOB, FGPIOC, FGPIOD, FGPIOE, FGPIOF, FGPIOG, FGPIOH, FGPIOI, FGPIOJ, FGPIOK, FGPIOL, FGPIOM }

/*!
 * @}
 */ /* end of group FGPIO_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- FTFA Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTFA_Peripheral_Access_Layer FTFA Peripheral Access Layer
 * @{
 */

