nxp-mcuxpresso/mcux-sdk/devices/MKM35Z7/MKM35Z7.h
/* The count of MCM_MATCR */
#define MCM_MATCR_COUNT                          (1U)


/*!
 * @}
 */ /* end of group MCM_Register_Masks */


/* MCM - Peripheral instance base addresses */
/** Peripheral MCM base address */
#define MCM_BASE                                 (0xF0003000u)
/** Peripheral MCM base pointer */
#define MCM                                      ((MCM_Type *)MCM_BASE)
/** Array initializer of MCM peripheral base addresses */
#define MCM_BASE_ADDRS                           { MCM_BASE }
/** Array initializer of MCM peripheral base pointers */
#define MCM_BASE_PTRS                            { MCM }

/*!
 * @}
 */ /* end of group MCM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- MMAU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MMAU_Peripheral_Access_Layer MMAU Peripheral Access Layer
 * @{
 */

/** MMAU - Register Layout Typedef */
typedef struct {
  __IO uint32_t X0;                                /**< Operand Register X0, offset: 0x0 */
  __IO uint32_t X1;                                /**< Operand Register X1, offset: 0x4 */
  __IO uint32_t X2;                                /**< Operand Register X2, offset: 0x8 */
  __IO uint32_t X3;                                /**< Operand Register X3, offset: 0xC */
  __IO uint32_t A0;                                /**< Accumulator Register A0, offset: 0x10 */
  __IO uint32_t A1;                                /**< Accumulator Register A1, offset: 0x14 */
  __IO uint32_t CSR;                               /**< Control/Status Register, offset: 0x18 */
  __O  uint32_t CSR_IF_CLR;                        /**< CSR Interrupt Flags Clearance Register, offset: 0x1C */
} MMAU_Type;

/* ----------------------------------------------------------------------------
   -- MMAU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MMAU_Register_Masks MMAU Register Masks
 * @{
 */

/*! @name X0 - Operand Register X0 */
/*! @{ */
#define MMAU_X0_X0_MASK                          (0xFFFFFFFFU)
#define MMAU_X0_X0_SHIFT                         (0U)
/*! X0 - Operand Register X0
 */
#define MMAU_X0_X0(x)                            (((uint32_t)(((uint32_t)(x)) << MMAU_X0_X0_SHIFT)) & MMAU_X0_X0_MASK)
/*! @} */

/*! @name X1 - Operand Register X1 */
/*! @{ */
#define MMAU_X1_X1_MASK                          (0xFFFFFFFFU)
#define MMAU_X1_X1_SHIFT                         (0U)
/*! X1 - Operand Register X1
 */
#define MMAU_X1_X1(x)                            (((uint32_t)(((uint32_t)(x)) << MMAU_X1_X1_SHIFT)) & MMAU_X1_X1_MASK)
/*! @} */

/*! @name X2 - Operand Register X2 */
/*! @{ */
#define MMAU_X2_X2_MASK                          (0xFFFFFFFFU)
#define MMAU_X2_X2_SHIFT                         (0U)
/*! X2 - Operand Register X2
 */
#define MMAU_X2_X2(x)                            (((uint32_t)(((uint32_t)(x)) << MMAU_X2_X2_SHIFT)) & MMAU_X2_X2_MASK)
/*! @} */

/*! @name X3 - Operand Register X3 */
/*! @{ */
#define MMAU_X3_X3_MASK                          (0xFFFFFFFFU)
#define MMAU_X3_X3_SHIFT                         (0U)
/*! X3 - Operand Register X3
 */
#define MMAU_X3_X3(x)                            (((uint32_t)(((uint32_t)(x)) << MMAU_X3_X3_SHIFT)) & MMAU_X3_X3_MASK)
/*! @} */

/*! @name A0 - Accumulator Register A0 */
/*! @{ */
#define MMAU_A0_A0_MASK                          (0xFFFFFFFFU)
#define MMAU_A0_A0_SHIFT                         (0U)
/*! A0 - Accumulator Register A0
 */
#define MMAU_A0_A0(x)                            (((uint32_t)(((uint32_t)(x)) << MMAU_A0_A0_SHIFT)) & MMAU_A0_A0_MASK)
/*! @} */

/*! @name A1 - Accumulator Register A1 */
/*! @{ */
#define MMAU_A1_A1_MASK                          (0xFFFFFFFFU)
#define MMAU_A1_A1_SHIFT                         (0U)
/*! A1 - Accumulator Register A1
 */
#define MMAU_A1_A1(x)                            (((uint32_t)(((uint32_t)(x)) << MMAU_A1_A1_SHIFT)) & MMAU_A1_A1_MASK)
/*! @} */

/*! @name CSR - Control/Status Register */
/*! @{ */
#define MMAU_CSR_Q_MASK                          (0x1U)
#define MMAU_CSR_Q_SHIFT                         (0U)
/*! Q - Q flag: Accumulation Overflow
 *  0b0..No accumulation operation or accumulation operation does not overflow
 *  0b1..Accumulation overflows during a MAC instruction
 */
#define MMAU_CSR_Q(x)                            (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_Q_SHIFT)) & MMAU_CSR_Q_MASK)
#define MMAU_CSR_V_MASK                          (0x2U)
#define MMAU_CSR_V_SHIFT                         (1U)
/*! V - V flag: Multiply or Divide overflow
 *  0b0..Calculation is not include divider or multiply, or the product/quotient does not overflow
 *  0b1..Product in multiply or multiply with accumulation, or quotient of a divide overflows
 */
#define MMAU_CSR_V(x)                            (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_V_SHIFT)) & MMAU_CSR_V_MASK)
#define MMAU_CSR_DZ_MASK                         (0x4U)
#define MMAU_CSR_DZ_SHIFT                        (2U)
/*! DZ - DZ flag: Divide by Zero
 *  0b0..For divide, the divisor is not zero, or the calculation is not divide
 *  0b1..For divide, the divisor is zero, which is a divide-by-zero error
 */
#define MMAU_CSR_DZ(x)                           (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_DZ_SHIFT)) & MMAU_CSR_DZ_MASK)
#define MMAU_CSR_N_MASK                          (0x8U)
#define MMAU_CSR_N_SHIFT                         (3U)
/*! N - N flag: Signed calculation result is negative
 *  0b0..Calculation raw result is zero or positive, or unsigned number
 *  0b1..Calculation raw result is negative
 */
#define MMAU_CSR_N(x)                            (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_N_SHIFT)) & MMAU_CSR_N_MASK)
#define MMAU_CSR_QIF_MASK                        (0x10U)
#define MMAU_CSR_QIF_SHIFT                       (4U)
/*! QIF - Q Interrupt Flag: Accumulation Overflow Interrupt Status
 *  0b0..No accumulation operation or accumulation operation does not overflow
 *  0b1..Accumulation overflows during a MAC instruction
 */
#define MMAU_CSR_QIF(x)                          (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_QIF_SHIFT)) & MMAU_CSR_QIF_MASK)
#define MMAU_CSR_VIF_MASK                        (0x20U)
#define MMAU_CSR_VIF_SHIFT                       (5U)
/*! VIF - V Interrupt Flag: Multiply or Divide overflow
 *  0b0..Calculation is not include divider or multiply, or the product/quotient does not overflow
 *  0b1..Product in multiply or multiply with accumulation, or quotient of a divide overflows
 */
#define MMAU_CSR_VIF(x)                          (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_VIF_SHIFT)) & MMAU_CSR_VIF_MASK)
#define MMAU_CSR_DZIF_MASK                       (0x40U)
#define MMAU_CSR_DZIF_SHIFT                      (6U)
/*! DZIF - DZ Interrupt Flag: Divide by Zero
 *  0b0..For divide, the divisor is not zero, or the calculation is not divide
 *  0b1..For divide, the divisor is zero, which is a divide-by-zero error
 */
#define MMAU_CSR_DZIF(x)                         (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_DZIF_SHIFT)) & MMAU_CSR_DZIF_MASK)
#define MMAU_CSR_QIE_MASK                        (0x1000U)
#define MMAU_CSR_QIE_SHIFT                       (12U)
/*! QIE - Accumulation Overflow (Q flag) Interrupt Enable
 *  0b0..Q flag (CSR[QIF]) set will not generate interrupt.
 *  0b1..Q flag (CSR[QIF]) set will generate interrupt to inform an accumulation overflow
 */
#define MMAU_CSR_QIE(x)                          (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_QIE_SHIFT)) & MMAU_CSR_QIE_MASK)
#define MMAU_CSR_VIE_MASK                        (0x2000U)
#define MMAU_CSR_VIE_SHIFT                       (13U)
/*! VIE - Divide/Multiply Overflow (V flag) Interrupt Enable
 *  0b0..V flag (CSR[VIF]) set will not generate interrupt.
 *  0b1..V flag (CSR[VIF]) set will generate interrupt to inform a divide or multiply overflow
 */
#define MMAU_CSR_VIE(x)                          (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_VIE_SHIFT)) & MMAU_CSR_VIE_MASK)
#define MMAU_CSR_DZIE_MASK                       (0x4000U)
#define MMAU_CSR_DZIE_SHIFT                      (14U)
/*! DZIE - Divide-by-Zero Interrupt Enable
 *  0b0..MMAU will not generate interrupt even CSR[DZIF]=1
 *  0b1..If CSR[DZIF] = 1, MMAU will generate an interrupt to signal a divide-by-zero.
 */
#define MMAU_CSR_DZIE(x)                         (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_DZIE_SHIFT)) & MMAU_CSR_DZIE_MASK)
#define MMAU_CSR_DRE_MASK                        (0x10000U)
#define MMAU_CSR_DRE_SHIFT                       (16U)
/*! DRE - DMA Request Enable
 *  0b0..MMAU will not generate DMA request when in IDLE (not busy) state
 *  0b1..MMAU will generate DMA request when in IDLE (not busy) state
 */
#define MMAU_CSR_DRE(x)                          (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_DRE_SHIFT)) & MMAU_CSR_DRE_MASK)
#define MMAU_CSR_SO_MASK                         (0x20000U)
#define MMAU_CSR_SO_SHIFT                        (17U)
/*! SO - Supervisor-Only
 *  0b0..MMAU registers can be access in both User Mode or Supervisor Mode
 *  0b1..MMAU registers can only be access in Supervisor Mode
 */
#define MMAU_CSR_SO(x)                           (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_SO_SHIFT)) & MMAU_CSR_SO_MASK)
#define MMAU_CSR_HDR_MASK                        (0xF00000U)
#define MMAU_CSR_HDR_SHIFT                       (20U)
/*! HDR - Hardware Revision Level
 *  0b0000..Current Hardware Revision Level is 0000
 */
#define MMAU_CSR_HDR(x)                          (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_HDR_SHIFT)) & MMAU_CSR_HDR_MASK)
#define MMAU_CSR_BUSY_MASK                       (0x80000000U)
#define MMAU_CSR_BUSY_SHIFT                      (31U)
/*! BUSY - BUSY
 *  0b0..MMAU is idle
 *  0b1..MMAU is busy performing a divide or square root calculation
 */
#define MMAU_CSR_BUSY(x)                         (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_BUSY_SHIFT)) & MMAU_CSR_BUSY_MASK)
/*! @} */

/*! @name CSR_IF_CLR - CSR Interrupt Flags Clearance Register */
/*! @{ */
#define MMAU_CSR_IF_CLR_Q_MASK                   (0x1U)
#define MMAU_CSR_IF_CLR_Q_SHIFT                  (0U)
/*! Q - Q flag: Accumulation Overflow
 *  0b0..Write "0" will clear CSR[Q]
 *  0b1..Write "1" will set CSR[Q]
 */
#define MMAU_CSR_IF_CLR_Q(x)                     (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_IF_CLR_Q_SHIFT)) & MMAU_CSR_IF_CLR_Q_MASK)
#define MMAU_CSR_IF_CLR_V_MASK                   (0x2U)
#define MMAU_CSR_IF_CLR_V_SHIFT                  (1U)
/*! V - V flag: Multiply or Divide overflow
 *  0b0..Write "0" will clear CSR[V]
 *  0b1..Write "1" will set CSR[V]
 */
#define MMAU_CSR_IF_CLR_V(x)                     (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_IF_CLR_V_SHIFT)) & MMAU_CSR_IF_CLR_V_MASK)
#define MMAU_CSR_IF_CLR_DZ_MASK                  (0x4U)
#define MMAU_CSR_IF_CLR_DZ_SHIFT                 (2U)
/*! DZ - DZ flag: Divide by Zero
 *  0b0..Write "0" will clear CSR[DZ]
 *  0b1..Write "1" will set CSR[DZ]
 */
#define MMAU_CSR_IF_CLR_DZ(x)                    (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_IF_CLR_DZ_SHIFT)) & MMAU_CSR_IF_CLR_DZ_MASK)
#define MMAU_CSR_IF_CLR_N_MASK                   (0x8U)
#define MMAU_CSR_IF_CLR_N_SHIFT                  (3U)
/*! N - N flag: Signed calculation result is negative
 *  0b0..Write "0" to clear CSR[N]
 *  0b1..Write "1" to set CSR[N]
 */
#define MMAU_CSR_IF_CLR_N(x)                     (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_IF_CLR_N_SHIFT)) & MMAU_CSR_IF_CLR_N_MASK)
#define MMAU_CSR_IF_CLR_QIF_MASK                 (0x10U)
#define MMAU_CSR_IF_CLR_QIF_SHIFT                (4U)
/*! QIF - Q Interrupt Flag: Accumulation Overflow Interrupt Status
 *  0b0..Write "0" is ignored
 *  0b1..Write "1" to clear CSR[QIF]
 */
#define MMAU_CSR_IF_CLR_QIF(x)                   (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_IF_CLR_QIF_SHIFT)) & MMAU_CSR_IF_CLR_QIF_MASK)
#define MMAU_CSR_IF_CLR_VIF_MASK                 (0x20U)
#define MMAU_CSR_IF_CLR_VIF_SHIFT                (5U)
/*! VIF - V Interrupt Flag: Multiply or Divide overflow
 *  0b0..Write "0" is ignored
 *  0b1..Write "1" to clear CSR[VIF]
 */
#define MMAU_CSR_IF_CLR_VIF(x)                   (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_IF_CLR_VIF_SHIFT)) & MMAU_CSR_IF_CLR_VIF_MASK)
#define MMAU_CSR_IF_CLR_DZIF_MASK                (0x40U)
#define MMAU_CSR_IF_CLR_DZIF_SHIFT               (6U)
/*! DZIF - DZ Interrupt Flag: Divide by Zero
 *  0b0..Write "0" is ignored
 *  0b1..Write "1" to clear CSR[DZIF]
 */
#define MMAU_CSR_IF_CLR_DZIF(x)                  (((uint32_t)(((uint32_t)(x)) << MMAU_CSR_IF_CLR_DZIF_SHIFT)) & MMAU_CSR_IF_CLR_DZIF_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group MMAU_Register_Masks */


/* MMAU - Peripheral instance base addresses */
/** Peripheral MMAU base address */
#define MMAU_BASE                                (0xF0004000u)
/** Peripheral MMAU base pointer */
#define MMAU                                     ((MMAU_Type *)MMAU_BASE)
/** Array initializer of MMAU peripheral base addresses */
#define MMAU_BASE_ADDRS                          { MMAU_BASE }
/** Array initializer of MMAU peripheral base pointers */
#define MMAU_BASE_PTRS                           { MMAU }
/** Interrupt vectors for the MMAU peripheral type */
#define MMAU_IRQS                                { MMAU_IRQn }

/*!
 * @}
 */ /* end of group MMAU_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- MTB Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MTB_Peripheral_Access_Layer MTB Peripheral Access Layer
 * @{
 */

/** MTB - Register Layout Typedef */
typedef struct {
  __IO uint32_t POSITION;                          /**< MTB Position Register, offset: 0x0 */
  __IO uint32_t MASTER;                            /**< MTB Master Register, offset: 0x4 */
  __IO uint32_t FLOW;                              /**< MTB Flow Register, offset: 0x8 */
  __I  uint32_t BASE;                              /**< MTB Base Register, offset: 0xC */
       uint8_t RESERVED_0[3824];
  __I  uint32_t MODECTRL;                          /**< Integration Mode Control Register, offset: 0xF00 */
       uint8_t RESERVED_1[156];
  __I  uint32_t TAGSET;                            /**< Claim TAG Set Register, offset: 0xFA0 */
  __I  uint32_t TAGCLEAR;                          /**< Claim TAG Clear Register, offset: 0xFA4 */
       uint8_t RESERVED_2[8];
  __I  uint32_t LOCKACCESS;                        /**< Lock Access Register, offset: 0xFB0 */
  __I  uint32_t LOCKSTAT;                          /**< Lock Status Register, offset: 0xFB4 */
  __I  uint32_t AUTHSTAT;                          /**< Authentication Status Register, offset: 0xFB8 */
  __I  uint32_t DEVICEARCH;                        /**< Device Architecture Register, offset: 0xFBC */
       uint8_t RESERVED_3[8];
  __I  uint32_t DEVICECFG;                         /**< Device Configuration Register, offset: 0xFC8 */
  __I  uint32_t DEVICETYPID;                       /**< Device Type Identifier Register, offset: 0xFCC */
  __I  uint32_t PERIPHID4;                         /**< Peripheral ID Register, offset: 0xFD0 */
  __I  uint32_t PERIPHID5;                         /**< Peripheral ID Register, offset: 0xFD4 */
  __I  uint32_t PERIPHID6;                         /**< Peripheral ID Register, offset: 0xFD8 */
  __I  uint32_t PERIPHID7;                         /**< Peripheral ID Register, offset: 0xFDC */
  __I  uint32_t PERIPHID0;                         /**< Peripheral ID Register, offset: 0xFE0 */
  __I  uint32_t PERIPHID1;                         /**< Peripheral ID Register, offset: 0xFE4 */
  __I  uint32_t PERIPHID2;                         /**< Peripheral ID Register, offset: 0xFE8 */
  __I  uint32_t PERIPHID3;                         /**< Peripheral ID Register, offset: 0xFEC */
  __I  uint32_t COMPID[4];                         /**< Component ID Register, array offset: 0xFF0, array step: 0x4 */
} MTB_Type;

/* ----------------------------------------------------------------------------
   -- MTB Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MTB_Register_Masks MTB Register Masks
 * @{
 */

/*! @name POSITION - MTB Position Register */
/*! @{ */
#define MTB_POSITION_WRAP_MASK                   (0x4U)
#define MTB_POSITION_WRAP_SHIFT                  (2U)
/*! WRAP - WRAP
 */
#define MTB_POSITION_WRAP(x)                     (((uint32_t)(((uint32_t)(x)) << MTB_POSITION_WRAP_SHIFT)) & MTB_POSITION_WRAP_MASK)
#define MTB_POSITION_POINTER_MASK                (0xFFFFFFF8U)
#define MTB_POSITION_POINTER_SHIFT               (3U)
/*! POINTER - Trace Packet Address Pointer[28:0]
 */
#define MTB_POSITION_POINTER(x)                  (((uint32_t)(((uint32_t)(x)) << MTB_POSITION_POINTER_SHIFT)) & MTB_POSITION_POINTER_MASK)
/*! @} */

