nxp-mcuxpresso/mcux-sdk/devices/MKM35Z7/MKM35Z7.h
/*! @name SOPT1_CFG - SOPT1 Configuration Register */
/*! @{ */
#define SIM_SOPT1_CFG_LPTMRSEL0_MASK             (0x3U)
#define SIM_SOPT1_CFG_LPTMRSEL0_SHIFT            (0U)
/*! LPTMRSEL0 - LP Timer Channel0 Select
 *  0b00..CMP[0] output
 *  0b01..CMP[1] output
 *  0b10..CMP[2] output
 *  0b11..Reserved
 */
#define SIM_SOPT1_CFG_LPTMRSEL0(x)               (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_CFG_LPTMRSEL0_SHIFT)) & SIM_SOPT1_CFG_LPTMRSEL0_MASK)
#define SIM_SOPT1_CFG_LPTMRSEL1_MASK             (0xCU)
#define SIM_SOPT1_CFG_LPTMRSEL1_SHIFT            (2U)
/*! LPTMRSEL1 - LP Timer Channel1 Select
 *  0b00..Pad PTE4
 *  0b01..Pad PTF4
 *  0b10..Pad PTG1
 *  0b11..Reserved
 */
#define SIM_SOPT1_CFG_LPTMRSEL1(x)               (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_CFG_LPTMRSEL1_SHIFT)) & SIM_SOPT1_CFG_LPTMRSEL1_MASK)
#define SIM_SOPT1_CFG_LPTMRSEL2_MASK             (0x30U)
#define SIM_SOPT1_CFG_LPTMRSEL2_SHIFT            (4U)
/*! LPTMRSEL2 - LP Timer Channel2 Select
 *  0b00..Pad PTD6
 *  0b01..Pad PTF3
 *  0b10..Pad PTG5
 *  0b11..Reserved
 */
#define SIM_SOPT1_CFG_LPTMRSEL2(x)               (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_CFG_LPTMRSEL2_SHIFT)) & SIM_SOPT1_CFG_LPTMRSEL2_MASK)
#define SIM_SOPT1_CFG_LPTMRSEL3_MASK             (0xC0U)
#define SIM_SOPT1_CFG_LPTMRSEL3_SHIFT            (6U)
/*! LPTMRSEL3 - LP Timer Channel Select3
 *  0b00..Pad PTD5
 *  0b01..Pad PTG0
 *  0b10..Pad PTG6
 *  0b11..Reserved
 */
#define SIM_SOPT1_CFG_LPTMRSEL3(x)               (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_CFG_LPTMRSEL3_SHIFT)) & SIM_SOPT1_CFG_LPTMRSEL3_MASK)
#define SIM_SOPT1_CFG_RAMSBDIS_MASK              (0x100U)
#define SIM_SOPT1_CFG_RAMSBDIS_SHIFT             (8U)
/*! RAMSBDIS
 *  0b0..Source bias of System SRAM enabled during VLPR and VLPW modes.
 *  0b1..Source bias of System SRAM disabled during VLPR and VLPW modes.
 */
#define SIM_SOPT1_CFG_RAMSBDIS(x)                (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_CFG_RAMSBDIS_SHIFT)) & SIM_SOPT1_CFG_RAMSBDIS_MASK)
#define SIM_SOPT1_CFG_RAMBPEN_MASK               (0x200U)
#define SIM_SOPT1_CFG_RAMBPEN_SHIFT              (9U)
/*! RAMBPEN - RAM Bitline Precharge Enable
 *  0b0..Bitline precharge of system SRAM disabled during VLPR and VLPW modes.
 *  0b1..Bitline precharge of system SRAM enabled during VLPR and VLPW modes.
 */
#define SIM_SOPT1_CFG_RAMBPEN(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_CFG_RAMBPEN_SHIFT)) & SIM_SOPT1_CFG_RAMBPEN_MASK)
#define SIM_SOPT1_CFG_LPTMR1SEL0_MASK            (0x30000U)
#define SIM_SOPT1_CFG_LPTMR1SEL0_SHIFT           (16U)
/*! LPTMR1SEL0 - LP Timer1 Channel0 Select
 *  0b00..CMP[0] output
 *  0b01..CMP[1] output
 *  0b10..CMP[2] output
 *  0b11..Reserved
 */
#define SIM_SOPT1_CFG_LPTMR1SEL0(x)              (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_CFG_LPTMR1SEL0_SHIFT)) & SIM_SOPT1_CFG_LPTMR1SEL0_MASK)
#define SIM_SOPT1_CFG_LPTMR1SEL1_MASK            (0xC0000U)
#define SIM_SOPT1_CFG_LPTMR1SEL1_SHIFT           (18U)
/*! LPTMR1SEL1 - LP Timer1 Channel1 Select1
 *  0b00..PAD PTC5
 *  0b01..PAD PTG7
 *  0b10..PAD PTJ4
 *  0b11..Reserved
 */
#define SIM_SOPT1_CFG_LPTMR1SEL1(x)              (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_CFG_LPTMR1SEL1_SHIFT)) & SIM_SOPT1_CFG_LPTMR1SEL1_MASK)
#define SIM_SOPT1_CFG_LPTMR1SEL2_MASK            (0x300000U)
#define SIM_SOPT1_CFG_LPTMR1SEL2_SHIFT           (20U)
/*! LPTMR1SEL2 - LP Timer1 Channel2 Select
 *  0b00..Pad PTD3
 *  0b01..Pad PTH4
 *  0b10..Pad PTJ7
 *  0b11..Reserved
 */
#define SIM_SOPT1_CFG_LPTMR1SEL2(x)              (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_CFG_LPTMR1SEL2_SHIFT)) & SIM_SOPT1_CFG_LPTMR1SEL2_MASK)
#define SIM_SOPT1_CFG_LPTMR1SEL3_MASK            (0xC00000U)
#define SIM_SOPT1_CFG_LPTMR1SEL3_SHIFT           (22U)
/*! LPTMR1SEL3 - LP Timer1 Channel3 Select
 *  0b00..Pad PTD4
 *  0b01..Pad PTH5
 *  0b10..Pad PTK0
 *  0b11..Reserved
 */
#define SIM_SOPT1_CFG_LPTMR1SEL3(x)              (((uint32_t)(((uint32_t)(x)) << SIM_SOPT1_CFG_LPTMR1SEL3_SHIFT)) & SIM_SOPT1_CFG_LPTMR1SEL3_MASK)
/*! @} */

/*! @name CTRL_REG - System Control Register */
/*! @{ */
#define SIM_CTRL_REG_NMIDIS_MASK                 (0x1U)
#define SIM_CTRL_REG_NMIDIS_SHIFT                (0U)
/*! NMIDIS - NMI Disable
 *  0b0..NMI enabled
 *  0b1..NMI disabled
 */
#define SIM_CTRL_REG_NMIDIS(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_NMIDIS_SHIFT)) & SIM_CTRL_REG_NMIDIS_MASK)
#define SIM_CTRL_REG_PLLVLPEN_MASK               (0x2U)
#define SIM_CTRL_REG_PLLVLPEN_SHIFT              (1U)
/*! PLLVLPEN - PLL VLP Enable
 */
#define SIM_CTRL_REG_PLLVLPEN(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_PLLVLPEN_SHIFT)) & SIM_CTRL_REG_PLLVLPEN_MASK)
#define SIM_CTRL_REG_ADCTRGSEL_MASK              (0x18U)
#define SIM_CTRL_REG_ADCTRGSEL_SHIFT             (3U)
/*! ADCTRGSEL - SAR ADC Trigger Clock Select
 *  0b00..Bus ClockDuring Low Power Modes such as stop, the Bus clock is not available for conversion and should
 *        not be selected in case a conversion needs to be performed while in stop.
 *  0b01..ADC asynchronous Clock
 *  0b10..ERCLK32K
 *  0b11..OSCCLK
 */
#define SIM_CTRL_REG_ADCTRGSEL(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_ADCTRGSEL_SHIFT)) & SIM_CTRL_REG_ADCTRGSEL_MASK)
#define SIM_CTRL_REG_CLKOUT_MASK                 (0xE0U)
#define SIM_CTRL_REG_CLKOUT_SHIFT                (5U)
/*! CLKOUT - Clock out Select
 *  0b000..Disabled
 *  0b001..Gated Core Clk
 *  0b010..Bus Clk
 *  0b011..LPO clock from PMC
 *  0b100..IRC clock from MCG
 *  0b101..Muxed 32Khz source (please refer to SOPT1[19:18] for possible options)
 *  0b110..MHz Oscillator external reference clock
 *  0b111..PLL clock output from MCG
 */
#define SIM_CTRL_REG_CLKOUT(x)                   (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_CLKOUT_SHIFT)) & SIM_CTRL_REG_CLKOUT_MASK)
#define SIM_CTRL_REG_SPI0_INV0_MASK              (0x100U)
#define SIM_CTRL_REG_SPI0_INV0_SHIFT             (8U)
/*! SPI0_INV0
 *  0b0..not inverted
 *  0b1..inverts SS
 */
#define SIM_CTRL_REG_SPI0_INV0(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI0_INV0_SHIFT)) & SIM_CTRL_REG_SPI0_INV0_MASK)
#define SIM_CTRL_REG_SPI0_INV1_MASK              (0x200U)
#define SIM_CTRL_REG_SPI0_INV1_SHIFT             (9U)
/*! SPI0_INV1
 *  0b0..not inverted
 *  0b1..inverts SCK
 */
#define SIM_CTRL_REG_SPI0_INV1(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI0_INV1_SHIFT)) & SIM_CTRL_REG_SPI0_INV1_MASK)
#define SIM_CTRL_REG_SPI0_INV2_MASK              (0x400U)
#define SIM_CTRL_REG_SPI0_INV2_SHIFT             (10U)
/*! SPI0_INV2
 *  0b0..not inverted
 *  0b1..inverts MOSI
 */
#define SIM_CTRL_REG_SPI0_INV2(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI0_INV2_SHIFT)) & SIM_CTRL_REG_SPI0_INV2_MASK)
#define SIM_CTRL_REG_SPI0_INV3_MASK              (0x800U)
#define SIM_CTRL_REG_SPI0_INV3_SHIFT             (11U)
/*! SPI0_INV3
 *  0b0..not inverted
 *  0b1..inverts MISO
 */
#define SIM_CTRL_REG_SPI0_INV3(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI0_INV3_SHIFT)) & SIM_CTRL_REG_SPI0_INV3_MASK)
#define SIM_CTRL_REG_SPI1_INV0_MASK              (0x1000U)
#define SIM_CTRL_REG_SPI1_INV0_SHIFT             (12U)
/*! SPI1_INV0
 *  0b0..not inverted
 *  0b1..inverts SS
 */
#define SIM_CTRL_REG_SPI1_INV0(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI1_INV0_SHIFT)) & SIM_CTRL_REG_SPI1_INV0_MASK)
#define SIM_CTRL_REG_SPI1_INV1_MASK              (0x2000U)
#define SIM_CTRL_REG_SPI1_INV1_SHIFT             (13U)
/*! SPI1_INV1
 *  0b0..not inverted
 *  0b1..inverts SCK
 */
#define SIM_CTRL_REG_SPI1_INV1(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI1_INV1_SHIFT)) & SIM_CTRL_REG_SPI1_INV1_MASK)
#define SIM_CTRL_REG_SPI1_INV2_MASK              (0x4000U)
#define SIM_CTRL_REG_SPI1_INV2_SHIFT             (14U)
/*! SPI1_INV2
 *  0b0..not inverted
 *  0b1..inverts MOSI
 */
#define SIM_CTRL_REG_SPI1_INV2(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI1_INV2_SHIFT)) & SIM_CTRL_REG_SPI1_INV2_MASK)
#define SIM_CTRL_REG_SPI1_INV3_MASK              (0x8000U)
#define SIM_CTRL_REG_SPI1_INV3_SHIFT             (15U)
/*! SPI1_INV3
 *  0b0..not inverted
 *  0b1..inverts MISO
 */
#define SIM_CTRL_REG_SPI1_INV3(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI1_INV3_SHIFT)) & SIM_CTRL_REG_SPI1_INV3_MASK)
#define SIM_CTRL_REG_PLLFLLSEL_MASK              (0x30000U)
#define SIM_CTRL_REG_PLLFLLSEL_SHIFT             (16U)
/*! PLLFLLSEL - PLL/FLL selection
 *  0b00..MCGFLLCLK
 *  0b01..MCGPLLCLK
 *  0b10..BUSCLK
 *  0b11..OSC32KCLK (RTC Oscillator output)
 */
#define SIM_CTRL_REG_PLLFLLSEL(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_PLLFLLSEL_SHIFT)) & SIM_CTRL_REG_PLLFLLSEL_MASK)
#define SIM_CTRL_REG_SPI2_INV0_MASK              (0x40000U)
#define SIM_CTRL_REG_SPI2_INV0_SHIFT             (18U)
/*! SPI2_INV0
 *  0b0..not inverted
 *  0b1..inverts SS
 */
#define SIM_CTRL_REG_SPI2_INV0(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI2_INV0_SHIFT)) & SIM_CTRL_REG_SPI2_INV0_MASK)
#define SIM_CTRL_REG_SPI2_INV1_MASK              (0x80000U)
#define SIM_CTRL_REG_SPI2_INV1_SHIFT             (19U)
/*! SPI2_INV1
 *  0b0..not inverted
 *  0b1..inverts SCK
 */
#define SIM_CTRL_REG_SPI2_INV1(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI2_INV1_SHIFT)) & SIM_CTRL_REG_SPI2_INV1_MASK)
#define SIM_CTRL_REG_SPI2_INV2_MASK              (0x100000U)
#define SIM_CTRL_REG_SPI2_INV2_SHIFT             (20U)
/*! SPI2_INV2
 *  0b0..not inverted
 *  0b1..inverts MOSI
 */
#define SIM_CTRL_REG_SPI2_INV2(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI2_INV2_SHIFT)) & SIM_CTRL_REG_SPI2_INV2_MASK)
#define SIM_CTRL_REG_XBARCLKOUT_MASK             (0xE00000U)
#define SIM_CTRL_REG_XBARCLKOUT_SHIFT            (21U)
/*! XBARCLKOUT - XBAR clock out selection
 *  0b000..Disabled
 *  0b001..Gated Core Clk
 *  0b010..Bus Clk
 *  0b011..LPO clock from PMC
 *  0b100..IRC clock from MCG
 *  0b101..MUXed 32 kHz source (please refer to SOPT1[19:18] for possible options)
 *  0b110..MHz Oscillator external reference clock
 *  0b111..PLL clock output from MCG
 */
#define SIM_CTRL_REG_XBARCLKOUT(x)               (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_XBARCLKOUT_SHIFT)) & SIM_CTRL_REG_XBARCLKOUT_MASK)
#define SIM_CTRL_REG_AFEOUTCLKSEL_MASK           (0x1000000U)
#define SIM_CTRL_REG_AFEOUTCLKSEL_SHIFT          (24U)
/*! AFEOUTCLKSEL - AFE clock output select
 *  0b0..AFE output clock is divided by AFE clock prescaler.
 *  0b1..AFE output clock is NOT divided by AFE clock prescaler.
 */
#define SIM_CTRL_REG_AFEOUTCLKSEL(x)             (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_AFEOUTCLKSEL_SHIFT)) & SIM_CTRL_REG_AFEOUTCLKSEL_MASK)
#define SIM_CTRL_REG_SPI2_INV3_MASK              (0x2000000U)
#define SIM_CTRL_REG_SPI2_INV3_SHIFT             (25U)
/*! SPI2_INV3
 *  0b0..not inverted
 *  0b1..inverts MISO
 */
#define SIM_CTRL_REG_SPI2_INV3(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_SPI2_INV3_SHIFT)) & SIM_CTRL_REG_SPI2_INV3_MASK)
#define SIM_CTRL_REG_LPUARTSRC_MASK              (0xC000000U)
#define SIM_CTRL_REG_LPUARTSRC_SHIFT             (26U)
/*! LPUARTSRC - LPUART clock Source configuration
 *  0b00..Clock disabled
 *  0b01..MCGPLLCLK/MCGFLLCLK
 *  0b10..OSCERCLK
 *  0b11..MCGIRCLK
 */
#define SIM_CTRL_REG_LPUARTSRC(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_LPUARTSRC_SHIFT)) & SIM_CTRL_REG_LPUARTSRC_MASK)
#define SIM_CTRL_REG_RTC_OSC32K_COUNT4_INIT_CLR_MASK (0x10000000U)
#define SIM_CTRL_REG_RTC_OSC32K_COUNT4_INIT_CLR_SHIFT (28U)
/*! RTC_OSC32K_COUNT4_INIT_CLR - RTC_OSC32K_COUNT4_INIT_CLR
 */
#define SIM_CTRL_REG_RTC_OSC32K_COUNT4_INIT_CLR(x) (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_RTC_OSC32K_COUNT4_INIT_CLR_SHIFT)) & SIM_CTRL_REG_RTC_OSC32K_COUNT4_INIT_CLR_MASK)
#define SIM_CTRL_REG_PDBCLKSRC_MASK              (0x40000000U)
#define SIM_CTRL_REG_PDBCLKSRC_SHIFT             (30U)
/*! PDBCLKSRC - PDB Clock Source configuration
 *  0b0..BUSCLK is used as PDB clock.
 *  0b1..MCGPLLCLK is used as PDB clock.
 */
#define SIM_CTRL_REG_PDBCLKSRC(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_PDBCLKSRC_SHIFT)) & SIM_CTRL_REG_PDBCLKSRC_MASK)
#define SIM_CTRL_REG_TMRFREEZE_MASK              (0x80000000U)
#define SIM_CTRL_REG_TMRFREEZE_SHIFT             (31U)
/*! TMRFREEZE - QTMR counters Freeze control
 *  0b0..QTMR counters operate normally.
 *  0b1..QTMR counters and OFLAGs are reset. Clearing this bit will resume QTMR operation.
 */
#define SIM_CTRL_REG_TMRFREEZE(x)                (((uint32_t)(((uint32_t)(x)) << SIM_CTRL_REG_TMRFREEZE_SHIFT)) & SIM_CTRL_REG_TMRFREEZE_MASK)
/*! @} */

/*! @name SDID - System Device Identification Register */
/*! @{ */
#define SIM_SDID_PINID_MASK                      (0xFU)
#define SIM_SDID_PINID_SHIFT                     (0U)
/*! PINID - Pincount identification
 *  0b0011..Reserved
 *  0b0100..Reserved
 *  0b0101..Reserved
 *  0b0110..Reserved
 *  0b0111..Reserved
 *  0b1000..100-pin
 *  0b1001..Reserved
 *  0b1010..144-pin
 *  0b1011..Reserved
 *  0b1100..Reserved
 *  0b1101..Reserved
 *  0b1110..Reserved
 *  0b1111..Reserved
 */
#define SIM_SDID_PINID(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SDID_PINID_SHIFT)) & SIM_SDID_PINID_MASK)
#define SIM_SDID_DIEID_MASK                      (0xF0U)
#define SIM_SDID_DIEID_SHIFT                     (4U)
/*! DIEID - Die ID
 *  0b0000..First cut
 */
#define SIM_SDID_DIEID(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SDID_DIEID_SHIFT)) & SIM_SDID_DIEID_MASK)
#define SIM_SDID_REVID_MASK                      (0xF00U)
#define SIM_SDID_REVID_SHIFT                     (8U)
/*! REVID - Revision ID
 *  0b0000..First cut
 */
#define SIM_SDID_REVID(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SDID_REVID_SHIFT)) & SIM_SDID_REVID_MASK)
#define SIM_SDID_SRAMSIZE_MASK                   (0xF000U)
#define SIM_SDID_SRAMSIZE_SHIFT                  (12U)
/*! SRAMSIZE - SRAM Size
 *  0b0110..32 KB SRAM
 *  0b0111..64 KB SRAM
 */
#define SIM_SDID_SRAMSIZE(x)                     (((uint32_t)(((uint32_t)(x)) << SIM_SDID_SRAMSIZE_SHIFT)) & SIM_SDID_SRAMSIZE_MASK)
#define SIM_SDID_ATTR_MASK                       (0xF0000U)
#define SIM_SDID_ATTR_SHIFT                      (16U)
/*! ATTR - Attribute ID
 *  0b0000..M0+ core
 */
#define SIM_SDID_ATTR(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SDID_ATTR_SHIFT)) & SIM_SDID_ATTR_MASK)
#define SIM_SDID_SERIESID_MASK                   (0xF00000U)
#define SIM_SDID_SERIESID_SHIFT                  (20U)
/*! SERIESID - Series ID
 *  0b0011..Metering Series
 */
#define SIM_SDID_SERIESID(x)                     (((uint32_t)(((uint32_t)(x)) << SIM_SDID_SERIESID_SHIFT)) & SIM_SDID_SERIESID_MASK)
#define SIM_SDID_SUBFAMID_MASK                   (0xF000000U)
#define SIM_SDID_SUBFAMID_SHIFT                  (24U)
/*! SUBFAMID - Sub-Family ID
 *  0b0000..Device derivatives with NO AFE enabled
 *  0b0001..Device derivatives with 1 AFE enabled
 *  0b0010..Device derivatives with 2 AFE enabled
 *  0b0011..Device derivatives with 3 AFE enabled
 *  0b0100..Device derivatives with 4 AFE enabled
 */
#define SIM_SDID_SUBFAMID(x)                     (((uint32_t)(((uint32_t)(x)) << SIM_SDID_SUBFAMID_SHIFT)) & SIM_SDID_SUBFAMID_MASK)
#define SIM_SDID_FAMID_MASK                      (0xF0000000U)
#define SIM_SDID_FAMID_SHIFT                     (28U)
/*! FAMID - Metering family ID
 *  0b0001..Device derivatives without LCD
 *  0b0011..Device derivatives with LCD
 */
#define SIM_SDID_FAMID(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SDID_FAMID_SHIFT)) & SIM_SDID_FAMID_MASK)
/*! @} */

/*! @name SCGC4 - System Clock Gating Control Register 4 */
/*! @{ */
#define SIM_SCGC4_EWM_MASK                       (0x2U)
#define SIM_SCGC4_EWM_SHIFT                      (1U)
/*! EWM - External Watchdog Monitor Clock gate control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_EWM(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_EWM_SHIFT)) & SIM_SCGC4_EWM_MASK)
#define SIM_SCGC4_I2C0_MASK                      (0x80U)
#define SIM_SCGC4_I2C0_SHIFT                     (7U)
/*! I2C0 - I2C0 Clock Gate Control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_I2C0(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_I2C0_SHIFT)) & SIM_SCGC4_I2C0_MASK)
#define SIM_SCGC4_I2C1_MASK                      (0x100U)
#define SIM_SCGC4_I2C1_SHIFT                     (8U)
/*! I2C1 - I2C1 Clock Gate Control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_I2C1(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_I2C1_SHIFT)) & SIM_SCGC4_I2C1_MASK)
#define SIM_SCGC4_UART0_MASK                     (0x400U)
#define SIM_SCGC4_UART0_SHIFT                    (10U)
/*! UART0 - UART0 Clock Gate Control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_UART0(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_UART0_SHIFT)) & SIM_SCGC4_UART0_MASK)
#define SIM_SCGC4_UART1_MASK                     (0x800U)
#define SIM_SCGC4_UART1_SHIFT                    (11U)
/*! UART1 - UART1 Clock Gate Control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_UART1(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_UART1_SHIFT)) & SIM_SCGC4_UART1_MASK)
#define SIM_SCGC4_UART2_MASK                     (0x1000U)
#define SIM_SCGC4_UART2_SHIFT                    (12U)
/*! UART2 - UART2 Clock Gate Control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_UART2(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_UART2_SHIFT)) & SIM_SCGC4_UART2_MASK)
#define SIM_SCGC4_UART3_MASK                     (0x2000U)
#define SIM_SCGC4_UART3_SHIFT                    (13U)
/*! UART3 - UART3 Clock Gate Control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_UART3(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_UART3_SHIFT)) & SIM_SCGC4_UART3_MASK)
#define SIM_SCGC4_VREF_MASK                      (0x8000U)
#define SIM_SCGC4_VREF_SHIFT                     (15U)
/*! VREF - VREF Clock Gate Control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_VREF(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_VREF_SHIFT)) & SIM_SCGC4_VREF_MASK)
#define SIM_SCGC4_CMP_MASK                       (0x40000U)
#define SIM_SCGC4_CMP_SHIFT                      (18U)
/*! CMP - High Speed Comparator Clock Gate Control.
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_CMP(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_CMP_SHIFT)) & SIM_SCGC4_CMP_MASK)
#define SIM_SCGC4_SPI0_MASK                      (0x200000U)
#define SIM_SCGC4_SPI0_SHIFT                     (21U)
/*! SPI0 - SPI0 Clock Gate Control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_SPI0(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_SPI0_SHIFT)) & SIM_SCGC4_SPI0_MASK)
#define SIM_SCGC4_SPI1_MASK                      (0x400000U)
#define SIM_SCGC4_SPI1_SHIFT                     (22U)
/*! SPI1 - SPI1 Clock Gate Control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_SPI1(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_SPI1_SHIFT)) & SIM_SCGC4_SPI1_MASK)
#define SIM_SCGC4_SPI2_MASK                      (0x800000U)
#define SIM_SCGC4_SPI2_SHIFT                     (23U)
/*! SPI2 - SPI2 Clock Gate Control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_SPI2(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_SPI2_SHIFT)) & SIM_SCGC4_SPI2_MASK)
/*! @} */

